package com.daralmathour.altaefhessan;

import java.util.ArrayList;

/**
 * Created by codelab on 1/1/2018.
 */

public class AppConfigurations {

    public   ArrayList<SoarInfo> allSoar= new ArrayList<>();

    public   ArrayList<CoreTable> QuranData=new ArrayList<>();


    public AppConfigurations()
    {
        allSoar= new ArrayList<>();
        allSoar.add(new SoarInfo("الفاتحة",true,7,1));
        allSoar.add(new SoarInfo("البقرة",false,286,2));
        allSoar.add(new SoarInfo("آل عمران",false,200,50));
        allSoar.add(new SoarInfo("النساء",false,176,77));
        allSoar.add(new SoarInfo("المائدة",false,120,106));
        allSoar.add(new SoarInfo("الأنعام",true,165,128));
        allSoar.add(new SoarInfo("الأعراف",true,206,151));
        allSoar.add(new SoarInfo("الأنفال",false,75,177));
        allSoar.add(new SoarInfo("التوبة",false,129,187));
        allSoar.add(new SoarInfo("يونس",true,109,208));
        allSoar.add(new SoarInfo("هود",true,123,221));
        allSoar.add(new SoarInfo("يوسف",true,111,235));
        allSoar.add(new SoarInfo("الرعد",false,43,249));
        allSoar.add(new SoarInfo("إبراهيم",true,52,255));
        allSoar.add(new SoarInfo("الحجر",true,99,262));
        allSoar.add(new SoarInfo("النحل",true,128,267));
        allSoar.add(new SoarInfo("الإسراء",true,111,282));
        allSoar.add(new SoarInfo("الكهف",true,110,293));
        allSoar.add(new SoarInfo("مريم",true,98,305));
        allSoar.add(new SoarInfo("طه",true,135,312));
        allSoar.add(new SoarInfo("الأنبياء",true,112,322));
        allSoar.add(new SoarInfo("الحج",false,78,332));
        allSoar.add(new SoarInfo("المؤمنون",true,118,342));
        allSoar.add(new SoarInfo("النور",false,64,350));
        allSoar.add(new SoarInfo("الفرقان",true,77,359));
        allSoar.add(new SoarInfo("الشعراء",true,227,367));
        allSoar.add(new SoarInfo("النمل",true,93,377));
        allSoar.add(new SoarInfo("القصص",true,88,385));
        allSoar.add(new SoarInfo("العنكبوت",true,69,396));
        allSoar.add(new SoarInfo("الروم",true,60,404));
        allSoar.add(new SoarInfo("لقمان",true,34,411));
        allSoar.add(new SoarInfo("السجدة",true,30,415));
        allSoar.add(new SoarInfo("الأحزاب",false,73,418));
        allSoar.add(new SoarInfo("سبأ",true,54,428));
        allSoar.add(new SoarInfo("فاطر",true,45,434));
        allSoar.add(new SoarInfo("يس",true,83,440));
        allSoar.add(new SoarInfo("الصافات",true,182,446));
        allSoar.add(new SoarInfo("ص",true,88,453));
        allSoar.add(new SoarInfo("الزمر",true,75,458));
        allSoar.add(new SoarInfo("غافر",true,85,467));
        allSoar.add(new SoarInfo("فصلت",true,54,477));
        allSoar.add(new SoarInfo("الشورى",true,53,483));
        allSoar.add(new SoarInfo("الزخرف",true,89,489));
        allSoar.add(new SoarInfo("الدخان",true,59,496));
        allSoar.add(new SoarInfo("الجاثية",true,37,499));
        allSoar.add(new SoarInfo("الأحقاف",true,35,502));
        allSoar.add(new SoarInfo("محمد",false,38,507));
        allSoar.add(new SoarInfo("الفتح",false,29,511));
        allSoar.add(new SoarInfo("الحجرات",false,18,515));
        allSoar.add(new SoarInfo("ق",true,45,518));
        allSoar.add(new SoarInfo("الذاريات",true,60,520));
        allSoar.add(new SoarInfo("الطور",true,49,523));
        allSoar.add(new SoarInfo("النجم",true,62,526));
        allSoar.add(new SoarInfo("القمر",true,55,528));
        allSoar.add(new SoarInfo("الرحمن",false,78,531));
        allSoar.add(new SoarInfo("الواقعة",true,96,534));
        allSoar.add(new SoarInfo("الحديد",false,29,537));
        allSoar.add(new SoarInfo("المجادلة",false,22,542));
        allSoar.add(new SoarInfo("الحشر",false,24,545));
        allSoar.add(new SoarInfo("الممتحنة",false,13,549));
        allSoar.add(new SoarInfo("الصف",false,14,551));
        allSoar.add(new SoarInfo("الجمعة",false,11,553));
        allSoar.add(new SoarInfo("المنافقون",false,11,554));
        allSoar.add(new SoarInfo("التغابن",false,18,556));
        allSoar.add(new SoarInfo("الطلاق",false,12,558));
        allSoar.add(new SoarInfo("التحريم",false,12,560));
        allSoar.add(new SoarInfo("الملك",true,30,562));
        allSoar.add(new SoarInfo("القلم",true,52,564));
        allSoar.add(new SoarInfo("الحاقة",true,52,566));
        allSoar.add(new SoarInfo("المعارج",true,44,568));
        allSoar.add(new SoarInfo("نوح",true,28,570));
        allSoar.add(new SoarInfo("الجن",true,28,572));
        allSoar.add(new SoarInfo("المزمل",true,20,574));
        allSoar.add(new SoarInfo("المدثر",true,56,575));
        allSoar.add(new SoarInfo("القيامة",true,40,577));
        allSoar.add(new SoarInfo("الإنسان",false,31,578));
        allSoar.add(new SoarInfo("المرسلات",true,50,580));
        allSoar.add(new SoarInfo("النبأ",true,40,582));
        allSoar.add(new SoarInfo("النازعات",true,46,583));
        allSoar.add(new SoarInfo("عبس",true,42,585));
        allSoar.add(new SoarInfo("التكوير",true,29,586));
        allSoar.add(new SoarInfo("الانفطار",true,19,587));
        allSoar.add(new SoarInfo("المطففين",true,36,587));
        allSoar.add(new SoarInfo("الانشقاق",true,25,589));
        allSoar.add(new SoarInfo("البروج",true,22,590));
        allSoar.add(new SoarInfo("الطارق",true,17,591));
        allSoar.add(new SoarInfo("الأعلى",true,19,591));
        allSoar.add(new SoarInfo("الغاشية",true,26,592));
        allSoar.add(new SoarInfo("الفجر",true,30,593));
        allSoar.add(new SoarInfo("البلد",true,20,594));
        allSoar.add(new SoarInfo("الشمس",true,15,595));
        allSoar.add(new SoarInfo("الليل",true,21,595));
        allSoar.add(new SoarInfo("الضحى",true,11,596));
        allSoar.add(new SoarInfo("الشرح",true, 8,596));
        allSoar.add(new SoarInfo("التين",true,8,597));
        allSoar.add(new SoarInfo("العلق",true,19,597));
        allSoar.add(new SoarInfo("القدر",true,5,598));
        allSoar.add(new SoarInfo("البينة",false,8,598));
        allSoar.add(new SoarInfo("الزلزلة",false,8,599));
        allSoar.add(new SoarInfo("العاديات",true,11,599));
        allSoar.add(new SoarInfo("القارعة",true,11,600));
        allSoar.add(new SoarInfo("التكاثر",true,8,600));
        allSoar.add(new SoarInfo("العصر",true,3,601));
        allSoar.add(new SoarInfo("الهمزة",true,9,601));
        allSoar.add(new SoarInfo("الفيل",true,5,601));
        allSoar.add(new SoarInfo("قريش",true,4,602));
        allSoar.add(new SoarInfo("الماعون",true,7,602));
        allSoar.add(new SoarInfo("الكوثر",true,3,602));
        allSoar.add(new SoarInfo("الكافرون",true,6,603));
        allSoar.add(new SoarInfo("النصر",false,3,603));
        allSoar.add(new SoarInfo("المسد",true,5,603));
        allSoar.add(new SoarInfo("الإخلاص",true,4,604));
        allSoar.add(new SoarInfo("الفلق",true,5,604));
        allSoar.add(new SoarInfo("الناس",true,6,604));


        //
       //int id, int FK_FesresId, int ayahId, String contentText, String audio_Url_Sodes, String audio_Url_Hozify, String audio_Url_Menshawy, String audio_Url_Abdelbaset, String image_Url) {

        QuranData.add(new CoreTable(1,1,1,"بسم الله الرحمن الرحيم\n" +
                "الحمد لله رب العالمين\n" +
                "الرحمن الرحيم\n" +
                "مالك يوم الدين\n" +
                "إياك نعبد وإياك نستعين\n" +
                "اهدنا الصراط المستقيم\n" +
                "صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين","s1_t001_001.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page001));
        QuranData.add(new CoreTable(2,2,1,"بسم الله الرحمن الرحيم الم\n" +
                "ذلك الكتاب لا ريب فيه هدى للمتقين\n" +
                "الذين يؤمنون بالغيب ويقيمون الصلاة ومما رزقناهم ينفقون\n" +
                "والذين يؤمنون بما أنزل إليك وما أنزل من قبلك وبالآخرة هم يوقنون\n" +
                "أولئك على هدى من ربهم وأولئك هم المفلحون","s1_t001_002.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page002));
        QuranData.add(new CoreTable(3,2,1,"إن الذين كفروا سواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون\n" +
                "ختم الله على قلوبهم وعلى سمعهم وعلى أبصارهم غشاوة ولهم عذاب عظيم\n" +
                "ومن الناس من يقول آمنا بالله وباليوم الآخر وما هم بمؤمنين\n" +
                "يخادعون الله والذين آمنوا وما يخدعون إلا أنفسهم وما يشعرون\n" +
                "في قلوبهم مرض فزادهم الله مرضا ولهم عذاب أليم بما كانوا يكذبون\n" +
                "وإذا قيل لهم لا تفسدوا في الأرض قالوا إنما نحن مصلحون\n" +
                "ألا إنهم هم المفسدون ولكن لا يشعرون\n" +
                "وإذا قيل لهم آمنوا كما آمن الناس قالوا أنؤمن كما آمن السفهاء ألا إنهم هم السفهاء ولكن لا يعلمون\n" +
                "وإذا لقوا الذين آمنوا قالوا آمنا وإذا خلوا إلى شياطينهم قالوا إنا معكم إنما نحن مستهزئون\n" +
                "الله يستهزئ بهم ويمدهم في طغيانهم يعمهون\n" +
                "أولئك الذين اشتروا الضلالة بالهدى فما ربحت تجارتهم وما كانوا مهتدين","s1_t001_003.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page003));
        QuranData.add(new CoreTable(4,2,1,"مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله ذهب الله بنورهم وتركهم في ظلمات لا يبصرون\n" +
                "صم بكم عمي فهم لا يرجعون\n" +
                "أو كصيب من السماء فيه ظلمات ورعد وبرق يجعلون أصابعهم في آذانهم من الصواعق حذر الموت والله محيط بالكافرين\n" +
                "يكاد البرق يخطف أبصارهم كلما أضاء لهم مشوا فيه وإذا أظلم عليهم قاموا ولو شاء الله لذهب بسمعهم وأبصارهم إن الله على كل شيء قدير\n" +
                "يا أيها الناس اعبدوا ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون\n" +
                "الذي جعل لكم الأرض فراشا والسماء بناء وأنزل من السماء ماء فأخرج به من الثمرات رزقا لكم فلا تجعلوا لله أندادا وأنتم تعلمون\n" +
                "وإن كنتم في ريب مما نزلنا على عبدنا فأتوا بسورة من مثله وادعوا شهداءكم من دون الله إن كنتم صادقين\n" +
                "فإن لم تفعلوا ولن تفعلوا فاتقوا النار التي وقودها الناس والحجارة أعدت للكافرين","s1_t001_004.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page004));
        QuranData.add(new CoreTable(5,2,1,"وبشر الذين آمنوا وعملوا الصالحات أن لهم جنات تجري من تحتها الأنهار كلما رزقوا منها من ثمرة رزقا قالوا هذا الذي رزقنا من قبل وأتوا به متشابها ولهم فيها أزواج مطهرة وهم فيها خالدون\n" +
                "إن الله لا يستحيي أن يضرب مثلا ما بعوضة فما فوقها فأما الذين آمنوا فيعلمون أنه الحق من ربهم وأما الذين كفروا فيقولون ماذا أراد الله بهذا مثلا يضل به كثيرا ويهدي به كثيرا وما يضل به إلا الفاسقين\n" +
                "الذين ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض أولئك هم الخاسرون\n" +
                "كيف تكفرون بالله وكنتم أمواتا فأحياكم ثم يميتكم ثم يحييكم ثم إليه ترجعون\n" +
                "هو الذي خلق لكم ما في الأرض جميعا ثم استوى إلى السماء فسواهن سبع سماوات وهو بكل شيء عليم","s1_t001_005.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page005));
        QuranData.add(new CoreTable(6,2,1,"وإذ قال ربك للملائكة إني جاعل في الأرض خليفة قالوا أتجعل فيها من يفسد فيها ويسفك الدماء ونحن نسبح بحمدك ونقدس لك قال إني أعلم ما لا تعلمون\n" +
                "وعلم آدم الأسماء كلها ثم عرضهم على الملائكة فقال أنبئوني بأسماء هؤلاء إن كنتم صادقين\n" +
                "قالوا سبحانك لا علم لنا إلا ما علمتنا إنك أنت العليم الحكيم\n" +
                "قال يا آدم أنبئهم بأسمائهم فلما أنبأهم بأسمائهم قال ألم أقل لكم إني أعلم غيب السماوات والأرض وأعلم ما تبدون وما كنتم تكتمون\n" +
                "وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس أبى واستكبر وكان من الكافرين\n" +
                "وقلنا يا آدم اسكن أنت وزوجك الجنة وكلا منها رغدا حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين\n" +
                "فأزلهما الشيطان عنها فأخرجهما مما كانا فيه وقلنا اهبطوا بعضكم لبعض عدو ولكم في الأرض مستقر ومتاع إلى حين\n" +
                "فتلقى آدم من ربه كلمات فتاب عليه إنه هو التواب الرحيم","s1_t001_006.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page006));
        QuranData.add(new CoreTable(7,2,1,"قلنا اهبطوا منها جميعا فإما يأتينكم مني هدى فمن تبع هداي فلا خوف عليهم ولا هم يحزنون\n" +
                "والذين كفروا وكذبوا بآياتنا أولئك أصحاب النار هم فيها خالدون\n" +
                "يا بني إسرائيل اذكروا نعمتي التي أنعمت عليكم وأوفوا بعهدي أوف بعهدكم وإياي فارهبون\n" +
                "وآمنوا بما أنزلت مصدقا لما معكم ولا تكونوا أول كافر به ولا تشتروا بآياتي ثمنا قليلا وإياي فاتقون\n" +
                "ولا تلبسوا الحق بالباطل وتكتموا الحق وأنتم تعلمون\n" +
                "وأقيموا الصلاة وآتوا الزكاة واركعوا مع الراكعين\n" +
                "أتأمرون الناس بالبر وتنسون أنفسكم وأنتم تتلون الكتاب أفلا تعقلون\n" +
                "واستعينوا بالصبر والصلاة وإنها لكبيرة إلا على الخاشعين\n" +
                "الذين يظنون أنهم ملاقو ربهم وأنهم إليه راجعون\n" +
                "يا بني إسرائيل اذكروا نعمتي التي أنعمت عليكم وأني فضلتكم على العالمين\n" +
                "واتقوا يوما لا تجزي نفس عن نفس شيئا ولا يقبل منها شفاعة ولا يؤخذ منها عدل ولا هم ينصرون","s1_t001_007.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page007));
        QuranData.add(new CoreTable(8,2,1,"وإذ نجيناكم من آل فرعون يسومونكم سوء العذاب يذبحون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم\n" +
                "وإذ فرقنا بكم البحر فأنجيناكم وأغرقنا آل فرعون وأنتم تنظرون\n" +
                "وإذ واعدنا موسى أربعين ليلة ثم اتخذتم العجل من بعده وأنتم ظالمون\n" +
                "ثم عفونا عنكم من بعد ذلك لعلكم تشكرون\n" +
                "وإذ آتينا موسى الكتاب والفرقان لعلكم تهتدون\n" +
                "وإذ قال موسى لقومه يا قوم إنكم ظلمتم أنفسكم باتخاذكم العجل فتوبوا إلى بارئكم فاقتلوا أنفسكم ذلكم خير لكم عند بارئكم فتاب عليكم إنه هو التواب الرحيم\n" +
                "وإذ قلتم يا موسى لن نؤمن لك حتى نرى الله جهرة فأخذتكم الصاعقة وأنتم تنظرون\n" +
                "ثم بعثناكم من بعد موتكم لعلكم تشكرون\n" +
                "وظللنا عليكم الغمام وأنزلنا عليكم المن والسلوى كلوا من طيبات ما رزقناكم وما ظلمونا ولكن كانوا أنفسهم يظلمون","s1_t001_008.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page008));
        QuranData.add(new CoreTable(9,2,1,"وإذ قلنا ادخلوا هذه القرية فكلوا منها حيث شئتم رغدا وادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم وسنزيد المحسنين\n" +
                "فبدل الذين ظلموا قولا غير الذي قيل لهم فأنزلنا على الذين ظلموا رجزا من السماء بما كانوا يفسقون\n" +
                "وإذ استسقى موسى لقومه فقلنا اضرب بعصاك الحجر فانفجرت منه اثنتا عشرة عينا قد علم كل أناس مشربهم كلوا واشربوا من رزق الله ولا تعثوا في الأرض مفسدين\n" +
                "وإذ قلتم يا موسى لن نصبر على طعام واحد فادع لنا ربك يخرج لنا مما تنبت الأرض من بقلها وقثائها وفومها وعدسها وبصلها قال أتستبدلون الذي هو أدنى بالذي هو خير اهبطوا مصرا فإن لكم ما سألتم وضربت عليهم الذلة والمسكنة وباءوا بغضب من الله ذلك بأنهم كانوا يكفرون بآيات الله ويقتلون النبيين بغير الحق ذلك بما عصوا وكانوا يعتدون","s1_t001_009.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page009));
        QuranData.add(new CoreTable(10,2,1,"إن الذين آمنوا والذين هادوا والنصارى والصابئين من آمن بالله واليوم الآخر وعمل صالحا فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون\n" +
                "وإذ أخذنا ميثاقكم ورفعنا فوقكم الطور خذوا ما آتيناكم بقوة واذكروا ما فيه لعلكم تتقون\n" +
                "ثم توليتم من بعد ذلك فلولا فضل الله عليكم ورحمته لكنتم من الخاسرين\n" +
                "ولقد علمتم الذين اعتدوا منكم في السبت فقلنا لهم كونوا قردة خاسئين\n" +
                "فجعلناها نكالا لما بين يديها وما خلفها وموعظة للمتقين\n" +
                "وإذ قال موسى لقومه إن الله يأمركم أن تذبحوا بقرة قالوا أتتخذنا هزوا قال أعوذ بالله أن أكون من الجاهلين\n" +
                "قالوا ادع لنا ربك يبين لنا ما هي قال إنه يقول إنها بقرة لا فارض ولا بكر عوان بين ذلك فافعلوا ما تؤمرون\n" +
                "قالوا ادع لنا ربك يبين لنا ما لونها قال إنه يقول إنها بقرة صفراء فاقع لونها تسر الناظرين","s1_t001_010.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page010));
        QuranData.add(new CoreTable(11,2,1,"قالوا ادع لنا ربك يبين لنا ما هي إن البقر تشابه علينا وإنا إن شاء الله لمهتدون\n" +
                "قال إنه يقول إنها بقرة لا ذلول تثير الأرض ولا تسقي الحرث مسلمة لا شية فيها قالوا الآن جئت بالحق فذبحوها وما كادوا يفعلون\n" +
                "وإذ قتلتم نفسا فادارأتم فيها والله مخرج ما كنتم تكتمون\n" +
                "فقلنا اضربوه ببعضها كذلك يحيي الله الموتى ويريكم آياته لعلكم تعقلون\n" +
                "ثم قست قلوبكم من بعد ذلك فهي كالحجارة أو أشد قسوة وإن من الحجارة لما يتفجر منه الأنهار وإن منها لما يشقق فيخرج منه الماء وإن منها لما يهبط من خشية الله وما الله بغافل عما تعملون\n" +
                "أفتطمعون أن يؤمنوا لكم وقد كان فريق منهم يسمعون كلام الله ثم يحرفونه من بعد ما عقلوه وهم يعلمون\n" +
                "وإذا لقوا الذين آمنوا قالوا آمنا وإذا خلا بعضهم إلى بعض قالوا أتحدثونهم بما فتح الله عليكم ليحاجوكم به عند ربكم أفلا تعقلون","s1_t001_011.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page011));
        QuranData.add(new CoreTable(12,2,1,"أولا يعلمون أن الله يعلم ما يسرون وما يعلنون\n" +
                "ومنهم أميون لا يعلمون الكتاب إلا أماني وإن هم إلا يظنون\n" +
                "فويل للذين يكتبون الكتاب بأيديهم ثم يقولون هذا من عند الله ليشتروا به ثمنا قليلا فويل لهم مما كتبت أيديهم وويل لهم مما يكسبون\n" +
                "وقالوا لن تمسنا النار إلا أياما معدودة قل أتخذتم عند الله عهدا فلن يخلف الله عهده أم تقولون على الله ما لا تعلمون\n" +
                "بلى من كسب سيئة وأحاطت به خطيئته فأولئك أصحاب النار هم فيها خالدون\n" +
                "والذين آمنوا وعملوا الصالحات أولئك أصحاب الجنة هم فيها خالدون\n" +
                "وإذ أخذنا ميثاق بني إسرائيل لا تعبدون إلا الله وبالوالدين إحسانا وذي القربى واليتامى والمساكين وقولوا للناس حسنا وأقيموا الصلاة وآتوا الزكاة ثم توليتم إلا قليلا منكم وأنتم معرضون","s1_t001_012.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page012));
        QuranData.add(new CoreTable(13,2,1,"وإذ أخذنا ميثاقكم لا تسفكون دماءكم ولا تخرجون أنفسكم من دياركم ثم أقررتم وأنتم تشهدون\n" +
                "ثم أنتم هؤلاء تقتلون أنفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالإثم والعدوان وإن يأتوكم أسارى تفادوهم وهو محرم عليكم إخراجهم أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة يردون إلى أشد العذاب وما الله بغافل عما تعملون\n" +
                "أولئك الذين اشتروا الحياة الدنيا بالآخرة فلا يخفف عنهم العذاب ولا هم ينصرون\n" +
                "ولقد آتينا موسى الكتاب وقفينا من بعده بالرسل وآتينا عيسى ابن مريم البينات وأيدناه بروح القدس أفكلما جاءكم رسول بما لا تهوى أنفسكم استكبرتم ففريقا كذبتم وفريقا تقتلون\n" +
                "وقالوا قلوبنا غلف بل لعنهم الله بكفرهم فقليلا ما يؤمنون","s1_t001_013.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page013));
        QuranData.add(new CoreTable(14,2,1,"ولما جاءهم كتاب من عند الله مصدق لما معهم وكانوا من قبل يستفتحون على الذين كفروا فلما جاءهم ما عرفوا كفروا به فلعنة الله على الكافرين\n" +
                "بئسما اشتروا به أنفسهم أن يكفروا بما أنزل الله بغيا أن ينزل الله من فضله على من يشاء من عباده فباءوا بغضب على غضب وللكافرين عذاب مهين\n" +
                "وإذا قيل لهم آمنوا بما أنزل الله قالوا نؤمن بما أنزل علينا ويكفرون بما وراءه وهو الحق مصدقا لما معهم قل فلم تقتلون أنبياء الله من قبل إن كنتم مؤمنين\n" +
                "ولقد جاءكم موسى بالبينات ثم اتخذتم العجل من بعده وأنتم ظالمون\n" +
                "وإذ أخذنا ميثاقكم ورفعنا فوقكم الطور خذوا ما آتيناكم بقوة واسمعوا قالوا سمعنا وعصينا وأشربوا في قلوبهم العجل بكفرهم قل بئسما يأمركم به إيمانكم إن كنتم مؤمنين","s1_t001_014.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page014));
        QuranData.add(new CoreTable(15,2,1,"قل إن كانت لكم الدار الآخرة عند الله خالصة من دون الناس فتمنوا الموت إن كنتم صادقين\n" +
                "ولن يتمنوه أبدا بما قدمت أيديهم والله عليم بالظالمين\n" +
                "ولتجدنهم أحرص الناس على حياة ومن الذين أشركوا يود أحدهم لو يعمر ألف سنة وما هو بمزحزحه من العذاب أن يعمر والله بصير بما يعملون\n" +
                "قل من كان عدوا لجبريل فإنه نزله على قلبك بإذن الله مصدقا لما بين يديه وهدى وبشرى للمؤمنين\n" +
                "من كان عدوا لله وملائكته ورسله وجبريل وميكال فإن الله عدو للكافرين\n" +
                "ولقد أنزلنا إليك آيات بينات وما يكفر بها إلا الفاسقون\n" +
                "أوكلما عاهدوا عهدا نبذه فريق منهم بل أكثرهم لا يؤمنون\n" +
                "ولما جاءهم رسول من عند الله مصدق لما معهم نبذ فريق من الذين أوتوا الكتاب كتاب الله وراء ظهورهم كأنهم لا يعلمون","s1_t001_015.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page015));
        QuranData.add(new CoreTable(16,2,1,"واتبعوا ما تتلو الشياطين على ملك سليمان وما كفر سليمان ولكن الشياطين كفروا يعلمون الناس السحر وما أنزل على الملكين ببابل هاروت وماروت وما يعلمان من أحد حتى يقولا إنما نحن فتنة فلا تكفر فيتعلمون منهما ما يفرقون به بين المرء وزوجه وما هم بضارين به من أحد إلا بإذن الله ويتعلمون ما يضرهم ولا ينفعهم ولقد علموا لمن اشتراه ما له في الآخرة من خلاق ولبئس ما شروا به أنفسهم لو كانوا يعلمون\n" +
                "ولو أنهم آمنوا واتقوا لمثوبة من عند الله خير لو كانوا يعلمون\n" +
                "يا أيها الذين آمنوا لا تقولوا راعنا وقولوا انظرنا واسمعوا وللكافرين عذاب أليم\n" +
                "ما يود الذين كفروا من أهل الكتاب ولا المشركين أن ينزل عليكم من خير من ربكم والله يختص برحمته من يشاء والله ذو الفضل العظيم","s1_t001_016.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page016));
        QuranData.add(new CoreTable(17,2,1,"ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها ألم تعلم أن الله على كل شيء قدير\n" +
                "ألم تعلم أن الله له ملك السماوات والأرض وما لكم من دون الله من ولي ولا نصير\n" +
                "أم تريدون أن تسألوا رسولكم كما سئل موسى من قبل ومن يتبدل الكفر بالإيمان فقد ضل سواء السبيل\n" +
                "ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا حسدا من عند أنفسهم من بعد ما تبين لهم الحق فاعفوا واصفحوا حتى يأتي الله بأمره إن الله على كل شيء قدير\n" +
                "وأقيموا الصلاة وآتوا الزكاة وما تقدموا لأنفسكم من خير تجدوه عند الله إن الله بما تعملون بصير\n" +
                "وقالوا لن يدخل الجنة إلا من كان هودا أو نصارى تلك أمانيهم قل هاتوا برهانكم إن كنتم صادقين\n" +
                "بلى من أسلم وجهه لله وهو محسن فله أجره عند ربه ولا خوف عليهم ولا هم يحزنون","s1_t001_017.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page017));
        QuranData.add(new CoreTable(18,2,1,"وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون\n" +
                "ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه وسعى في خرابها أولئك ما كان لهم أن يدخلوها إلا خائفين لهم في الدنيا خزي ولهم في الآخرة عذاب عظيم\n" +
                "ولله المشرق والمغرب فأينما تولوا فثم وجه الله إن الله واسع عليم\n" +
                "وقالوا اتخذ الله ولدا سبحانه بل له ما في السماوات والأرض كل له قانتون\n" +
                "بديع السماوات والأرض وإذا قضى أمرا فإنما يقول له كن فيكون\n" +
                "وقال الذين لا يعلمون لولا يكلمنا الله أو تأتينا آية كذلك قال الذين من قبلهم مثل قولهم تشابهت قلوبهم قد بينا الآيات لقوم يوقنون\n" +
                "إنا أرسلناك بالحق بشيرا ونذيرا ولا تسأل عن أصحاب الجحيم","s1_t001_018.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page018));
        QuranData.add(new CoreTable(19,2,1,"ولن ترضى عنك اليهود ولا النصارى حتى تتبع ملتهم قل إن هدى الله هو الهدى ولئن اتبعت أهواءهم بعد الذي جاءك من العلم ما لك من الله من ولي ولا نصير\n" +
                "الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به ومن يكفر به فأولئك هم الخاسرون\n" +
                "يا بني إسرائيل اذكروا نعمتي التي أنعمت عليكم وأني فضلتكم على العالمين\n" +
                "واتقوا يوما لا تجزي نفس عن نفس شيئا ولا يقبل منها عدل ولا تنفعها شفاعة ولا هم ينصرون\n" +
                "وإذ ابتلى إبراهيم ربه بكلمات فأتمهن قال إني جاعلك للناس إماما قال ومن ذريتي قال لا ينال عهدي الظالمين\n" +
                "وإذ جعلنا البيت مثابة للناس وأمنا واتخذوا من مقام إبراهيم مصلى وعهدنا إلى إبراهيم وإسماعيل أن طهرا بيتي للطائفين والعاكفين والركع السجود\n" +
                "وإذ قال إبراهيم رب اجعل هذا بلدا آمنا وارزق أهله من الثمرات من آمن منهم بالله واليوم الآخر قال ومن كفر فأمتعه قليلا ثم أضطره إلى عذاب النار وبئس المصير","s1_t001_019.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page019));
        QuranData.add(new CoreTable(20,2,1,"وإذ يرفع إبراهيم القواعد من البيت وإسماعيل ربنا تقبل منا إنك أنت السميع العليم\n" +
                "ربنا واجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك وأرنا مناسكنا وتب علينا إنك أنت التواب الرحيم\n" +
                "ربنا وابعث فيهم رسولا منهم يتلو عليهم آياتك ويعلمهم الكتاب والحكمة ويزكيهم إنك أنت العزيز الحكيم\n" +
                "ومن يرغب عن ملة إبراهيم إلا من سفه نفسه ولقد اصطفيناه في الدنيا وإنه في الآخرة لمن الصالحين\n" +
                "إذ قال له ربه أسلم قال أسلمت لرب العالمين\n" +
                "ووصى بها إبراهيم بنيه ويعقوب يا بني إن الله اصطفى لكم الدين فلا تموتن إلا وأنتم مسلمون\n" +
                "أم كنتم شهداء إذ حضر يعقوب الموت إذ قال لبنيه ما تعبدون من بعدي قالوا نعبد إلهك وإله آبائك إبراهيم وإسماعيل وإسحاق إلها واحدا ونحن له مسلمون\n" +
                "تلك أمة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسألون عما كانوا يعملون","s1_t001_020.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page020));
        QuranData.add(new CoreTable(21,2,1,"وقالوا كونوا هودا أو نصارى تهتدوا قل بل ملة إبراهيم حنيفا وما كان من المشركين\n" +
                "قولوا آمنا بالله وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط وما أوتي موسى وعيسى وما أوتي النبيون من ربهم لا نفرق بين أحد منهم ونحن له مسلمون\n" +
                "فإن آمنوا بمثل ما آمنتم به فقد اهتدوا وإن تولوا فإنما هم في شقاق فسيكفيكهم الله وهو السميع العليم\n" +
                "صبغة الله ومن أحسن من الله صبغة ونحن له عابدون\n" +
                "قل أتحاجوننا في الله وهو ربنا وربكم ولنا أعمالنا ولكم أعمالكم ونحن له مخلصون\n" +
                "أم تقولون إن إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط كانوا هودا أو نصارى قل أأنتم أعلم أم الله ومن أظلم ممن كتم شهادة عنده من الله وما الله بغافل عما تعملون\n" +
                "تلك أمة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسألون عما كانوا يعملون","s1_t001_020.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page021));
        QuranData.add(new CoreTable(22,2,1,"سيقول السفهاء من الناس ما ولاهم عن قبلتهم التي كانوا عليها قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم\n" +
                "وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا وما جعلنا القبلة التي كنت عليها إلا لنعلم من يتبع الرسول ممن ينقلب على عقبيه وإن كانت لكبيرة إلا على الذين هدى الله وما كان الله ليضيع إيمانكم إن الله بالناس لرءوف رحيم\n" +
                "قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا وجوهكم شطره وإن الذين أوتوا الكتاب ليعلمون أنه الحق من ربهم وما الله بغافل عما يعملون\n" +
                "ولئن أتيت الذين أوتوا الكتاب بكل آية ما تبعوا قبلتك وما أنت بتابع قبلتهم وما بعضهم بتابع قبلة بعض ولئن اتبعت أهواءهم من بعد ما جاءك من العلم إنك إذا لمن الظالمين","s1_t001_022.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page022));
        QuranData.add(new CoreTable(22,2,1,"","s1_t001_022.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page022));
        QuranData.add(new CoreTable(22,2,1,"","s1_t001_022.mp3","s2_t001_001.mp3","s3_t001_001.mp3","s4_t001_001.mp3",R.drawable.page022));

    }

}
